[
    "Chase that dream like you chased that person who didn't want you.",
    "Don't be afraid to fail. It's a part of life.",
    "People aren't afraid to be great, they're afraid to be great because the world is going to ask them to be great again.",
    "The same way people hate behind your back, someone's loving you behind your back as well.",
    "Lock in.",
    "You are bound by nothing.",
    "You are a worthy and valuable individual.",
    "Practice any art, not to make money, but to make your soul grow.",
    "I'm proud of you.",
    "The only person holding yourself back is yourself.",
    "You know what's in store for you.",
    "What are punishments from God if not gifts?",
    "Anyone can do it, but no one is going to do it like you.",
    "To become the person you want, you must destroy the person you are.",
    "No, you're not tired, you're just comfortable in your excuses.",
    "You're not overwhelmed, you're just undisciplined.",
    "You prayed for patience, so everything is delayed.",
    "It's not over until you win.",
    "I will win, not immediately, but definitely.",
    "Upgrade your life in silence.",
    "Be addicted to bettering yourself.",
    "Move like everything is going to work out. Because it will.",
    "Just make it exist first. You can make it good later.",
    "Directed by God.",
    "The magic you're looking for was in you all along.",
    "Starve your distractions. Feed your discipline.",
    "Stick to the plan, not your mood.",
    "It's not hard, it's just new.",
    "Accept people as they are, but place them where they belong.",
    "Don't be afraid of being a beginner.",
    "Don't spend another year doing the same shit.",
    "Grow better, not bitter.",
    "Stick to what you care about or else you'll be stuck with something you don't. Either way life demands commitment.",
    "Wait, you're goated twin.",
    "Live in the world, not your mind.",
    "How bad do you really want it?",
    "Without committment, you'll never start. Without consistency, you'll never finish.",
    "Silent moves, loud results.",
    "Chase the vision, not the validation",
    "People'll tell you that you need to be this and that... but why not be yourself?",
    "Every single day is a new chance to try again.",
    "Didn't wake up to be average.",
    "Your vibe will leave a mark I promise you that",
    "You were born to bend reality.",
    "If not you, then who?",
    "The wait will be worth it.",
    "We'll be ok twin.",
    "Even at your worst, you're still goated",
    "Your legs aren't giving out, your head is giving up.",
    "You run this shit, pay attention.",
    "Don't stop until you're insanely proud of yourself.",
    "You feel unsettled bcecause you know you are meant for more.",
    "An inch of movement will bring you closer to your goals, than a mile of intention.",
    "Your future needs you, your past doesn't.",
    "One day at a time.",
    "Do it for yourself",
    "You vs. You.",
    "Setbacks teach us lessons that winning never will.",
    "All for His glory.",
    "Effort over words.",
    "If you play, play to win.",
    "Reach for the stars twin.",
    "1% better every day.",
    "You don't need more time, you need more focus.",
    "Wage war on your weakness.",
    "We did not come from lesser men.",
    "No matter what happens, keep it rolling.",
    "It's only delusional until it works.",
    "Just get yours quietly.",
    "There is no tomorrow.",
    "Try anything. Risk everything.",
    "Being a male is a matter of birth. Being a man is a matter of choice.",
    "Obsession beats talent.",
    "This comeback is personal, it's an apology to yourself.",
    "That fear? It's lying to you.",
    "How can you lose? You started with nothing."
]