[
    "What do you call fake spaghetti? An impasta.",
    "How many tickles does it take to make an octopus laugh? Ten-tickles.",
    "What do you call a can opener that doesn't work? A can't opener.",
    "What do you call cheese that isn't yours? Nacho cheese.",
    "Why can't you give Elsa a balloon? Because she will let it go.",
    "What do you call a bee that can't make up its mind? A maybe.",
    "Why did the coffee file a police report? It got mugged.",
    "What do you call a sleeping bull? A bulldozer.",
    "Why did the tomato turn red? Because it saw the salad dressing.",
    "What do you call a fish with no eye? A fsh.",
    "Why did the melons get married? Because they cantaloupe.",
  "A man walks into a bar and there is a bunch of meat hanging from the ceiling. The man asks the bartender whats the deal with the meat and the bartender explains that if you jump and slap a piece of meat, you get to drink free for the night, but if you miss, the man must buy drinks for everyone in the bar. The man responds, ”Nah, the steaks are too high.”",
  "Why did the scarecrow win an award? Because he was outstanding in his field!",
  "A man took his date to a zoo. They were disappointed to find that it only contained one animal: a dog.It was a shitzu.",
  "What do you call a bear with no teeth? A gummy bear.",
  "A Buddhist monk walks up to a hot dog vendor and says, ”make me one with everything.”",
  "What did O say to Q? ”Put that thing back in your pants.”",
  "I quit my job at the helium factory today. I refuse to be spoken to in that tone of voice.",
  "What washes up on tiny beaches? Microwaves!",
  "Why did the stoplight turn red? Because it was embarrassed to be changing in the middle of the street!",
  "First rule of Thesaurus Club. You don't talk, converse, discuss, speak, chat, deliberate, confer, gab, gossip or natter about Thesaurus Club.",
  "What do you get when you mix a rhetorical question and a joke",
  "Two satellite dishes got married. The wedding wasn't all that great but the reception was awesome!",
  "What's brown and rhymes with Snoop? Dr. Dre",
  "I've got a joke about a tortilla but I think it might be a little too corny.",
  "What did the corn say after stubbing his toe? Aw shuck!",
  "What do you call a line of rabbits walking backwards? A receding hare line"
]