[
    "“Am I perspiring? No, it’s just the rain. These fools could never make me sweat.” - Obito Uchiha, Naruto",
    "“Wake up to reality! ... There can be no peace without strife, no victory without sacrifice. That is the reality of this world.” - Madara Uchiha, Naruto",
    "“Throughout heaven and earth, I alone am the honored one.” - Gojo Satoru, Jujutsu Kaisen",
    "“I am the hope of the universe... I am protection.” - Goku, Dragon Ball",
    "”Are you Gojo Satoru because you're the strongest? Or are you the strongest because you're Gojo?” - Suguru Geto, Jujutsu Kaisen",
    "”We evolve, beyond the person we were a minute before!... that's how a drill works!” - Simon, Gurren Lagann",
    "”Their memory serves as an example to us all!... My soldiers RAAAAAGE!” - Erwin Smith, Attack on Titan",
    "”Remember, with great power comes great responsibility.” - Ben Parker, Spider-Man",
    "”You either die a hero or you live long enough to see yourself become the villain.” - Harvey Dent, The Dark Knight",
    "”Do not pray for easy lives. Pray to be stronger men.” - John F. Kennedy",
    "”How much can you see, with those Sharingan of yours?” - Itachi Uchiha, Naruto",
    "”Since when were you under the impression that I wasn't using Kyoka Suigetsu?” - Sosuke Aizen, Bleach",
    "”Stand proud. You are strong.” - Ryomen Sukuna, Jujutsu Kaisen",
    "”MEANINGLESS, HUH? WHAT DO YOU KNOW OF MEANINGLESS?... He has stolen my honor, and his debts... must be paid!” - Vegeta, Dragon Ball",
    "”Like a soon to be broken man once said, 'You're either perfect, or you're not me'” - Perfect Cell, Dragon Ball Abridged",
    "”I have no enemies.” - Thorfinn, Vinland Saga",
    "”I am here. There is no greater security than that” - Genryusai Yamamoto, Bleach",
    "”Humankind cannot gain anything without first giving something in return. To obtain , something of equal value must be lost. That is Alchemy's First Law of Equivalent Exchange.” - Fullmetal Alchemist",
    "”The flame is the soul's breath. The black smoke is the soul's release. Ashes thou wert and art. May thy soul return to the great flame of fire. Látom” - Fire Force",
    "”Nothing happened.” - Roronoa Zoro, One Piece"
]
