[
  "If you know why you lost then you did it on purpose.",
  "You'll destroy your own peace confronting everything you see, just let them have it.",
  "Worrying is worshiping the problem, let it go.",
  "Knowledge isn't power until it's applied.",
  "Until it's done, tell no one.",
  "Nothing is that serious. Choose peace",
  "Accept people as they are, but place them where they belong",
  "Stick to what you care about or else you'll be stuck with something you don't. Either way life demands commitment.",
  "Keep the promises you make to yourself.",
  "It's about who stayed, not who promised.",
  "Forget who forgets you",
  "Accept your heart will break and trust that you will survive.",
  "Sunsets are proof that endings can be beautiful too.",
  "Existence could be beautiful. Or ugly. Depends on you.",
  "Never forget to be kind.",
  "Cry and keep going.",
  "Keep a part of yourself for yourself.",
  "Being in good shape is another way of showing self respect.",
  "We suffer more in imagination than in reality.",
  "One day you'll see why God made you wait",
  "A man alone is a neighbor of God",
  "Hope will keep you sane",
  "Fall in love with souls, not faces.",
  "The only true wisdom is in knowing you know nothing.",
  "Don't let temporary people do permanent damage.",
  "Don't trade your dignity for dopamine.",
  "Your next move matters more than your last mistake.",
  "As long as the dice is still rolling, you will get your six. For now, clap for others and show love.",
  "The best revenge is none. Don't ever become like them.",
  "All battles are won in prayer.",
  "Life goes on.",
  "Life is too short to spend it at war with yourself.",
  "When you wake up in the morning, think of what a privlege it is to be alive, to think, to enjoy, to love.",
  "How you speak to yourself matters.",
  "You can always be new again.",
  "Don't love a flower so much that you forget to water your own.",
  "The purpose of life is to experience.",
  "Make yourself a priority.",
  "Anything you lost, you weren't suposed to have.",
  "Make memories with the right people.",
  "Your whole life can be altered just by associating with someone. Be selective.",
  "If you deeply observe, everything is your teacher.",
  "Freedom is having nothing to chase, nothing to hide, and nothing to prove.",
  "You're so in your head you can't even enjoy where you are.",
  "Trust in your craft enough to admire it, study it, perfect it, breath it. Never stop getting better at whatever it is that you love to do.",
  "Just be happy, they hate that.",
  "You will be fine again, it just takes time.",
  "Be alone, it's peaceful.",
  "Who are you when no one is watching?",
  "Your ability to find the silly in the serious will take you far.",
  "There are seats waiting for you at tables you haven't even seen.",
  "Think highly of yourself.",
  "It's ok to get torn down and then rebuild yourself back.",
  "No one is praying for your downfall, you make your own self-destructive life choices.",
  "Who are you to judge another when you yourself walk as an imperfect man?"
]